app/views/books/books.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
                        <%= link_to user_path(f.id) do %>
                        <%= attachment_image_tag User.find(f.user_id), :profile_image, :fill,60,60, size: "100x100", format:"jpeg",fallback:"no_image.jpg" %>